[
  {
    "id": "Mazen Ahmed Al Jubeir",
    "name": "Mazen Ahmed Al Jubeir",
    "title": "Chairman of the Board of Jada",
    "info": "Relevant experience: Mazen Ahmed Al Jubeir is an active investor in SMEs and growth companies in Saudi Arabia and abroad. He is Managing Director of Jawaris Limited and serves on the Board of the Public Pension Agency, which disburses pensions for retired civil and military personnel and their dependents, as well as the boards of several other prominent public corporations, private sector companies, and social enterprises. He is a Trustee of the Oqal angel investor network. Mazen holds an MBA, graduated with the highest distinction from the Harvard Business School, where he was designated a George F. Baker Scholar. He also holds a BA with honors from Harvard College, where he received the John Harvard and Harvard College Scholarships for academic distinction."
  },
  {
    "id": "Tariq Linjawi",
    "name": "Tariq Linjawi",
    "title": "Jada Board Member",
    "info": "Relevant experience: Tariq Linjawi is an experienced investment advisor with an extensive background in business planning, banking, financial analysis and ‘go-to-market’ strategy. He is Managing Partner at United Consulting Group, a company that creates innovative solutions to business problems in a Saudi context. He is Chairman of Emirates NBD Capital KSA and sits on the boards of insurance broker Al Ahli Takaful Co, global asset manager Sedco Capital, and Al Siraj United. In 2017, he has been a member of the Board of Monshaat, the Saudi General Authority for Small and Medium Enterprises, formed to advise, support and promote the SME sector. And he has served as the CEO and head of Wealth management of NCB Capital. Tariq Linjawi holds an MBA from Cranfield School of Management and an undergraduate degree from Occidental College. He also attended the Advanced Management Program at Wharton Business School."
  },
  {
    "id": "Abdulaziz Al Naim",
    "name": "Abdulaziz Al Naim",
    "title": "Jada Board Member",
    "info": "Abdulaziz is the founder and Managing Director at Mayar Capital, a global investment management firm that serves institutions, family offices, and high net-worth individuals. Prior to founding Mayar, Abdulaziz served as Chairman, CEO and Fund Manager at Yareem Ltd., an investment company that he managed using a disciplined value investing approach. He was also Chairman of Yareem Arabia, a multi-unit restaurant company based in Al-Khobar, Saudi Arabia. Abdulaziz serves on several boards of directors including Basic Chemical Industries, GIB Capital, ATCO Group, and the Saudi Fund of Funds.  He is also a member of the Milken Institute’s Young Leaders Circle. Abdulaziz is a CFA charter holder and is a member of CFA Society of the UK and CFA Society Saudi Arabia. He holds a BS in Management Science with a concentration in Finance and a minor in Economics from the Massachusetts Institute of Technology."
  },
  {
    "id": "Mohammed Al Malki",
    "name": "Mohammed Al Malki",
    "title": "Jada Board Member",
    "info": "Relevant experience: In addition to his role on the Board of Jada, Mohammed Al Malki is also Vice President of Funding at Monshaat, the General Authority for Small and Medium Enterprises in Saudi Arabia. He was the Founder of Natej Financial Consulting and was the former CEO of KSAB Capital. Before that, he held senior management positions with a special focus on anti-money laundering at the Capital Markets Authority in Riyadh. After a career in banking with Samba Financial Group and Riyadh Bank, he spent time on secondment as an audit manager with the Securities Commission of Malaysia. Mohammed Al Malki holds an MBA from King Faisal University and is a Certified Compliance Officer, awarded by the American Academy of Financial Management."
  },
  {
    "id": "Amr Al Jallal",
    "name": "Amr Al Jallal",
    "title": "Jada Board Member",
    "info": "Relevant experience: Amr Al Jallal is a Managing Director at the Private Equity and Investment Banking team at Jadwa Investment, which is one of the leading investment management and investment banking firms in Saudi Arabia. Prior to joining Jadwa, Amr he held various worked in senior positions at the Saudi Fransi Capital as well as the Capital Market Authority. He also sets at the boards of various Saudi and regional companies. Amr holds an MBA from the Jesse H. Jones Graduate School of Management at Rice University, and a bachelor of science in Management Information Systems from King Fahd University of Petroleum and Minerals."
  },
  {
    "id": "Sebastián Miralles",
    "name": "Sebastián Miralles",
    "title": "Jada Board Member",
    "info": "Relevant experience: Sebastián Miralles is Managing Partner at Tempest Capital and a leading voice in the Latin American private equity industry. Throughout his career, he has participated in scores of transactions and has a reputation for identifying and partnering with leading entrepreneurs in growth industries. He is also a recognized expert on developing private equity and venture capital ecosystems within emerging markets. Previously, he has been Managing Director of Mexico Ventures, the Venture Capital and Mezzanine Division of Fondo de Fondos, and prior to that, he was the Principal coordinating the Private Equity team of CAF Development Bank of Latin America. Sebastián began his career working with the Global Value Equity team of Morgan Stanley and as a senior consultant in the Financial Services Group of Kroll. Sebastian was also Interim CFO of Clip, Mexico’s largest Fintech. Sebastián earned an MBA from IESE Business School and was valedictorian in his undergraduate class at Universidad Panamericana. He has both CFA and CAIA qualifications and is a founding member of the CFA Society of Mexico, and a Member of the Mexican Council on Foreign Relations."
  },
  {
    "id": "Mohammed Al Balaihed",
    "name": "Mohammed Al Balaihed",
    "title": "Jada Board Member",
    "info": "Relevant experience: Mohammed Al Balaihed is a Chartered Financial Analyst (CFA) charterholder. He is an Investment Manager at the Public Investment Fund, the sovereign wealth fund of Saudi Arabia. Prior to joining PIF, he was a Member of the Board at Virgin Mobile KSA, an Investment Associate at Sanabil Investments and a Senior Credit Analyst at SIDF, the Saudi Industrial Development Fund. Mohammed undertook a six-month secondment at private equity firm Hamilton Lane and earlier in his career, worked in the DWS Investments division of Deutsche Bank. In addition to his CFA certification, Mohammed holds a BSc in Finance awarded by Prince Sultan University."
  },
  {
    "id": "Adel Al Ateeq",
    "name": "Adel Al Ateeq",
    "title": "Jada Chief Executive Officer",
    "info": "Adel Al Ateeq was appointed CEO of Jada in 2019 and has over 25 years of experience in the management of private equity, venture capital, real estate, and public financial markets. He has held several leadership roles, most recently as the Deputy Chief Executive Officer of Riyad Capital. He previously held leadership positions in Riyad Bank and the Saudi Arabian Monetary Agency. Adel is a founding member of the Saudi Venture Capital and Private Equity Society and a member of its Board of Directors. He is also the current Chairman of Riyad Reit."
  }
]