[
  {
    "id": "Mazen Ahmed Al Jubeir",
    "name": "مازن الجبير",
    "title": "رئيس مجلس الإدارة",
    "info": "مازن أحمد الجبير هو مستثمر نشط في الشركات الناشئة والواعدة في المملكة العربية السعودية وخارجها. وهو المدير التنفيذي لشركة جوارس المحدودة وعضو في مجلس إدارة المؤسسة العامة للتقاعد، التي تقوم بصرف المعاشات التقاعدية للموظفين المدنيين والعسكريين المتقاعدين ومعاليهم، ويشغل منصب عضو مجلس إدارة في العديد من الشركات العامة البارزة وشركات القطاع الخاص والمؤسسات الاجتماعية. هو أحد أمناء مؤسسة عقال التي تربط بين رواد ورائدات الأعمال والمستثمرين. مازن حاصل على ماجستير في إدارة الأعمال، وتخرج بأعلى درجات الامتياز من كلية هارفارد للأعمال، وحاصل على منصب جورج إف. بيكر الأكاديمي. وعلى درجة البكالوريوس مع مرتبة الشرف من كلية هارفارد، حيث حصل على منحة جون هارفارد وكلية هارفارد الدراسية للتميز الأكاديمي."
  },
  {
    "id": "Tariq Linjawi",
    "name": "طارق لنجاوي",
    "title": "عضو مجلس إدارة",
    "info": "طارق لنجاوي مستشار استثمار ذو خبرة عالية وخلفية كبيرة في تخطيط الأعمال، والأعمال المصرفية، والتحليل المالي، واستراتيجية \"التوجه إلى السوق\". وهو شريك إداري في المجموعة الاستشارية المتحدة، وهي شركة تعمل على خلق حلول مبتكرة لمشاكل الأعمال في سياق سعودي. وهو رئيس مجلس إدارة \"الإمارات دبي الوطني كابيتال السعودية\"، وهو عضو في مجلس وسطاء التأمين \"الأهلي تكافل\" و \"سيدكو كابيتال\" و \"السراج المتحدة\". في عام 2017، كان عضوًا في مجلس إدارة، الهيئة السعودية العامة للمشاريع الصغيرة والمتوسطة \"منشآت\"، التي تم تشكيلها لتقديم المشورة ودعم وتشجيع قطاع الشركات الصغيرة والمتوسطة. وقد شغل منصب الرئيس التنفيذي ورئيس إدارة الثروات في الأهلي كابيتال. طارق لنجاوي حاصل على ماجستير إدارة الأعمال من كلية كرانفيلد للإدارة وشهادة البكالوريوس من كلية أوكسيدنتال. كما حضر برنامج الإدارة المتقدمة في كلية وارتون للأعمال."
  },
  {
    "id": "Abdulaziz Al Naim",
    "name": "عبدالعزيز النعيم",
    "title": "عضو مجلس إدارة",
    "info": "عبد العزيز هو المؤسس والمدير التنفيذي لميار كابيتال، وهي شركة عالمية لإدارة الاستثمار تخدم المؤسسات والمكاتب العائلية. قبل تأسيس ميار، شغل عبد العزيز منصب رئيس مجلس الإدارة والرئيس التنفيذي ومدير الصندوق في شركة يريم المحدودة وكان أيضًا رئيس مجلس إدارة شركة يريم العربية، وهي شركة مطاعم مقرها في الخبر، المملكة العربية السعودية. يعمل عبد العزيز في العديد من مجالس الإدارة بما في ذلك الصناعات الكيميائية الأساسية وجي بي كابيتال ومجموعة ATCO وهو أيضًا عضو في دائرة القادة الشباب بمعهد Milken Institute. عبد العزيز حائز على شهادة CFA وهو عضو في جمعية CFA في المملكة المتحدة وجمعية CFA في المملكة العربية السعودية. وهو حاصل على درجة البكالوريوس في العلوم الإدارية والعلوم المالية وشهادة في الاقتصاد من معهد ماساتشوستس للتكنولوجيا."
  },
  {
    "id": "Mohammed Al Malki",
    "name": "محمد المالكي",
    "title": "عضو مجلس إدارة",
    "info": "يشغل محمد المالكي منصب نائب رئيس التمويل في منشآت، الهيئة العامة للمنشآت الصغيرة والمتوسطة في المملكة العربية السعودية. كان مؤسس شركة نٍتاج للاستشارات المالية وكان الرئيس التنفيذي السابق لشركة كسب كابيتال. وشغل مناصب إدارية عليا في التدقيق الداخلي ومكافحة غسل الأموال في هيئة سوق رأس المال في السعودية.  لدية خبرة 15 سنة في القطاع المصرفي مع مجموعة سامبا المالية وبنك الرياض، وكذلك مديرًا معاراُ كمدير للتدقيق لدى هيئة الأوراق المالية الماليزية. محمد المالكي حاصل على ماجستير في إدارة الأعمال من جامعة الملك فيصل، وهو مسؤول التزام معتمد، ممنوحة من الأكاديمية الأمريكية للإدارة المالية."
  },
  {
    "id": "Amr Al Jallal",
    "name": "عمرو الجلال",
    "title": "عضو مجلس إدارة",
    "info": "عمر الجلال هو المدير التنفيذي لإدارة الملكية الخاصة والاستثمارات البنكية في جدوى للاستثمار، والتي تعد واحدة من الشركات الرائدة في مجال إدارة الاستثمارات والاستثمار المصرفي في المملكة العربية السعودية. قبل انضمامه إلى جدوى، شغل عمر العديد من المناصب العليا في السعودي الفرنسي كابيتال وكذلك هيئة سوق المال. وهو أيضًا عضو في مجالس إدارة لشركات سعودية وإقليمية عديدة. حصل عمر على ماجستير في إدارة الأعمال من كلية الدراسات العليا للإدارة بجيسي هـ. جونز بجامعة رايس، وبكالوريوس العلوم في نظم المعلومات الإدارية من جامعة الملك فهد للبترول والمعادن."
  },
  {
    "id": "Sebastián Miralles",
    "name": "سيباستيان ميراليس",
    "title": "عضو مجلس إدارة",
    "info": "سيباستيان ميراليس هو الشريك الإداري في تيمبيست كابيتال شارك خلال مسيرته المهنية في العديد من المعاملات وله خبرة في الشراكة مع رواد الأعمال الرائدين في الصناعات النامية. في السابق، كان يشغل منصب المدير العام لشركة Mexico Ventures، وVenture Capital وMezzanine Division في Fondo de Fondos، وقبل ذلك، كان المدير الرئيسي لتنسيق فريق الملكية الخاصة ببنك التنمية CAF في أمريكا اللاتينية. بدأ سيباستيان مسيرته المهنية في العمل مع فريق جلوبال فاليو للأسهم في مورجان ستانلي وكمستشار أقدم في مجموعة الخدمات المالية في كرول. سيباستيان كان أيضًا المدير المالي المؤقت لشركة Clip، أكبر شركة فنتك في المكسيك. حصل سيباستيان على درجة الماجستير في إدارة الأعمال من كلية IESE لإدارة الأعمال. حاصل على شهادة CFA وCAIA وهو عضو مؤسس لجمعية CFA في المكسيك وعضو في المجلس المكسيكي للعلاقات الخارجية."
  },
  {
    "id": "Mohammed Al Balaihed",
    "name": "محمد البليهد",
    "title": "عضو مجلس إدارة",
    "info": "محمد البلهيد حائز على شهادة (CFA). ويشغل منصباً إدارياً في صندوق الاستثمارات العامة ف. قبل انضمامه لصندوق الاستثمارات العامة، كان عضوًا في مجلس إدارة شركة فيرجن موبايل السعودية، وشريك استثمار في شركة سنابل للاستثمار، ومحلل ائتمان أول في الصندوق السعودي للتنمية الصناعية. وكان معاراً لمدة ستة أشهر في شركة هاملتون لين للأسهم الخاصة، وفي وقت سابق من حياته المهنية، عمل في قسم DWS للاستثمار في دويتشه بنك. بالإضافة إلى حصوله على شهادة CFA، حصل محمد على درجة البكالوريوس في العلوم المالية من جامعة الأمير سلطان."
  },
  {
    "id": "Adel Al Ateeq",
    "name": "عادل العتيق",
    "title": "الرئيس التنفيذي",
    "info": "تم تعيين عادل العتيق في منصب الرئيس التنفيذي لشركة جدافي عام 2019 ولديه أكثر من 25 عامًا من الخبرة في إدارة الأسهم الخاصة ورأس المال الاستثماري والعقارات والأسواق المالية العامة. وقد شغل العديد من الأدوار القيادية، وكان آخرها نائب الرئيس التنفيذي لشركة الرياض المالية. شغل سابقًا مناصب قيادية في بنك الرياض ومؤسسة النقد العربي السعودي. عادل عضو مؤسس في الجمعية السعودية لرؤوس الأموال والاستثمارات الخاصة وعضو في مجلس إدارتها. وهو أيضًا رئيس مجلس إدارة الرياض ريت."
  }
]